In [1]:
import pandas as pd
import numpy as np

In [6]:
first = pd.read_csv('1. from rank 1 to rank 209.csv')
first.head(2)

,Name,Rank,Level,Link,Gold,Silver,Bronze,Points,Joined
0,Chris Deotte,1,grandmaster,https://www.kaggle.com/cdeotte,71,17,3,"4,949",5 years ago
1,Mar√≠lia Prata,2,master,https://www.kaggle.com/mpwolke,12,39,448,"3,614",4 years ago

In [7]:
second = pd.read_csv('2. from rank 209 to rank 2040.csv')
second.head(2)

,Name,Rank,Level,Link,Gold,Silver,Bronze,Points,Joined
0,üåµ,210,master,https://www.kaggle.com/frankmollard,11,13,21,384,3 years ago
1,Ludovico Cuoghi,211,master,https://www.kaggle.com/ludovicocuoghi,3,15,1,383,2 years ago

In [8]:
third = pd.read_csv('3. from 2040 rank to 2863 rank.csv')
third.head(2)

,Name,Rank,Level,Link,Gold,Silver,Bronze,Points,Joined
0,myominhtet,2041,expert,https://www.kaggle.com/myominhtet,0,0,5,49,3 years ago
1,ƒê·∫∑ng Duy Thanh,2042,expert,https://www.kaggle.com/duythanhng,0,0,10,49,3 years ago

In [9]:
fourth = pd.read_csv('4. from rank 2863 to rank 4273.csv')
fourth.head(2)

,Name,Rank,Level,Link,Gold,Silver,Bronze,Points,Joined
0,Hugo,2864,expert,https://www.kaggle.com/hugolearn,0,0,5,31,a year ago
1,snowball,2865,expert,https://www.kaggle.com/yuyuyuyuy,0,0,6,31,a year ago

In [12]:
fifth = pd.read_csv('last.csv')
fifth

,Name,Rank,Level,Link,Gold,Silver,Bronze,Points,Joined
0,VirgoData,4274,expert,https://www.kaggle.com/virgodata,0,0,5,0,5 years ago
1,MHA,4275,expert,https://www.kaggle.com/hamzaashraf,0,0,5,0,5 years ago

# Concatenation

In [17]:
pd.concat([first,second,third,fourth,fifth],axis = 0).reset_index(drop=True).to_csv('Kaggle Notebook Tier Dataset.csv',index=False)